In [1]:
import numpy as np
import pandas as pd

In [2]:
#comando concat, semelhante ao union all do sql

In [3]:
colunas = ['col1','col2','col3','col4']

In [4]:
dados1 =  np.array(list(map(lambda x: 'A' + str(x), range(16)))).reshape(4,4)
dados2 =  np.array(list(map(lambda x: 'B' + str(x), range(16)))).reshape(4,4)
dados3 =  np.array(list(map(lambda x: 'C' + str(x), range(16)))).reshape(4,4)
dados4 =  np.array(list(map(lambda x: 'D' + str(x), range(16)))).reshape(4,4)
dados5 =  np.array(list(map(lambda x: 'E' + str(x), range(16)))).reshape(4,4)

In [5]:
df1 = pd.DataFrame(dados1,columns=colunas)
df2 = pd.DataFrame(dados2,columns=colunas)
df3 = pd.DataFrame(dados3,columns=colunas)
df4 = pd.DataFrame(dados4,columns=colunas,index=[1,2,3,4])
df5 = pd.DataFrame(dados5,columns=colunas,index=[5,6,7,8])

In [6]:
df1

  col1 col2 col3 col4
0   A0   A1   A2   A3
1   A4   A5   A6   A7
2   A8   A9  A10  A11
3  A12  A13  A14  A15

In [7]:
df2

  col1 col2 col3 col4
0   B0   B1   B2   B3
1   B4   B5   B6   B7
2   B8   B9  B10  B11
3  B12  B13  B14  B15

In [8]:
#select * from df1 union all selec * from df2

In [9]:
pd.concat([df1,df2])

  col1 col2 col3 col4
0   A0   A1   A2   A3
1   A4   A5   A6   A7
2   A8   A9  A10  A11
3  A12  A13  A14  A15
0   B0   B1   B2   B3
1   B4   B5   B6   B7
2   B8   B9  B10  B11
3  B12  B13  B14  B15

In [10]:
pd.concat([df1,df2,df3])

  col1 col2 col3 col4
0   A0   A1   A2   A3
1   A4   A5   A6   A7
2   A8   A9  A10  A11
3  A12  A13  A14  A15
0   B0   B1   B2   B3
1   B4   B5   B6   B7
2   B8   B9  B10  B11
3  B12  B13  B14  B15
0   C0   C1   C2   C3
1   C4   C5   C6   C7
2   C8   C9  C10  C11
3  C12  C13  C14  C15

In [11]:
#select df1.col1, df1.col2, df2.col3, df2.col4 from df1 inner join df2 on 1 = 1

In [12]:
#semelhante a um join no sql
pd.concat([df1,df2],axis=1)

  col1 col2 col3 col4 col1 col2 col3 col4
0   A0   A1   A2   A3   B0   B1   B2   B3
1   A4   A5   A6   A7   B4   B5   B6   B7
2   A8   A9  A10  A11   B8   B9  B10  B11
3  A12  A13  A14  A15  B12  B13  B14  B15

In [13]:
pd.concat([df1,df2,df3],axis=1)

  col1 col2 col3 col4 col1 col2 col3 col4 col1 col2 col3 col4
0   A0   A1   A2   A3   B0   B1   B2   B3   C0   C1   C2   C3
1   A4   A5   A6   A7   B4   B5   B6   B7   C4   C5   C6   C7
2   A8   A9  A10  A11   B8   B9  B10  B11   C8   C9  C10  C11
3  A12  A13  A14  A15  B12  B13  B14  B15  C12  C13  C14  C15

In [14]:
df4

  col1 col2 col3 col4
1   D0   D1   D2   D3
2   D4   D5   D6   D7
3   D8   D9  D10  D11
4  D12  D13  D14  D15

In [15]:
df5

  col1 col2 col3 col4
5   E0   E1   E2   E3
6   E4   E5   E6   E7
7   E8   E9  E10  E11
8  E12  E13  E14  E15

In [16]:
pd.concat([df4,df5])

  col1 col2 col3 col4
1   D0   D1   D2   D3
2   D4   D5   D6   D7
3   D8   D9  D10  D11
4  D12  D13  D14  D15
5   E0   E1   E2   E3
6   E4   E5   E6   E7
7   E8   E9  E10  E11
8  E12  E13  E14  E15

In [17]:
#select col1, col2, null as col3, null as col4  from t1 union all select null as col1, null as col2, col3, col4 from t2

In [19]:
pd.concat([df4,df5],axis=1).fillna(0)

  col1 col2 col3 col4 col1 col2 col3 col4
1   D0   D1   D2   D3    0    0    0    0
2   D4   D5   D6   D7    0    0    0    0
3   D8   D9  D10  D11    0    0    0    0
4  D12  D13  D14  D15    0    0    0    0
5    0    0    0    0   E0   E1   E2   E3
6    0    0    0    0   E4   E5   E6   E7
7    0    0    0    0   E8   E9  E10  E11
8    0    0    0    0  E12  E13  E14  E15

In [ ]:
#select t1.*, t2.* from t1 inner join t2 on t1.id = t2.key

In [20]:
colunas = ['id','nome','numero']
dados1 = [[0,'a',55.0,],[1,'b',12.0],[2,'c',98.5]]
dados2 = [[0,'a',32.8],[2,'d',871.9],[4,'e',812.123]]
left = pd.DataFrame(dados1,columns=colunas)
right = pd.DataFrame(dados2,columns=colunas)

In [21]:
left

   id nome  numero
0   0    a    55.0
1   1    b    12.0
2   2    c    98.5

In [22]:
right

   id nome   numero
0   0    a   32.800
1   2    d  871.900
2   4    e  812.123

In [23]:
pd.merge(left,right,how='inner',on='id')

   id nome_x  numero_x nome_y  numero_y
0   0      a      55.0      a      32.8
1   2      c      98.5      d     871.9

In [ ]:
#select t1.*, t2.* from t1 left join t2 on t1.id = t2.key

In [24]:
pd.merge(left,right,how='left',on='id')

   id nome_x  numero_x nome_y  numero_y
0   0      a      55.0      a      32.8
1   1      b      12.0    NaN       NaN
2   2      c      98.5      d     871.9

In [ ]:
#select t1.*, t2.* from t1 right join t2 on t1.id = t2.key

In [25]:
pd.merge(left,right,how='right',on='id')

   id nome_x  numero_x nome_y  numero_y
0   0      a      55.0      a    32.800
1   2      c      98.5      d   871.900
2   4    NaN       NaN      e   812.123

In [ ]:
#select t1.*, t2.* from t1 inner join t2 on t1.id = t2.key and t1.nome = t2.nome

In [26]:
pd.merge(left,right,how='inner',on=['id','nome'])

   id nome  numero_x  numero_y
0   0    a      55.0      32.8

In [27]:
pd.merge(left,right,how='xx',on='id')

KeyError: 'xx'

In [28]:
index_df1 = ['i1','i2','i3','i4']
index_df2 = ['i1','i3','i4','i5']
dados1 =  np.array(list(map(lambda x: 'A' + str(x), range(16)))).reshape(4,4)
dados2 =  np.array(list(map(lambda x: 'B' + str(x), range(16)))).reshape(4,4)

In [29]:
df1 = pd.DataFrame(dados1,columns=['A','B','C','D'],index=index_df1)
df2 = pd.DataFrame(dados2,columns=['E','F','G','H'],index=index_df2)

In [30]:
df1

      A    B    C    D
i1   A0   A1   A2   A3
i2   A4   A5   A6   A7
i3   A8   A9  A10  A11
i4  A12  A13  A14  A15

In [31]:
df2

      E    F    G    H
i1   B0   B1   B2   B3
i3   B4   B5   B6   B7
i4   B8   B9  B10  B11
i5  B12  B13  B14  B15

In [32]:
#faz um left join pelo index
df1.join(df2)

      A    B    C    D    E    F    G    H
i1   A0   A1   A2   A3   B0   B1   B2   B3
i2   A4   A5   A6   A7  NaN  NaN  NaN  NaN
i3   A8   A9  A10  A11   B4   B5   B6   B7
i4  A12  A13  A14  A15   B8   B9  B10  B11

In [33]:
df1.join(df2,how='outer')

      A    B    C    D    E    F    G    H
i1   A0   A1   A2   A3   B0   B1   B2   B3
i2   A4   A5   A6   A7  NaN  NaN  NaN  NaN
i3   A8   A9  A10  A11   B4   B5   B6   B7
i4  A12  A13  A14  A15   B8   B9  B10  B11
i5  NaN  NaN  NaN  NaN  B12  B13  B14  B15

In [ ]:
#distinct do sql em pandas

In [34]:
dados = {'id':[111111,111111,2222222,2222222],'nomes':['anderson','ueda','miura','sandro'],'valores':[1231,545,4637,675]}
df = pd.DataFrame(dados)

In [35]:
df

        id     nomes  valores
0   111111  anderson     1231
1   111111      ueda      545
2  2222222     miura     4637
3  2222222    sandro      675

In [ ]:
#select distinct id from t1

In [36]:
df['id'].unique()

array([ 111111, 2222222], dtype=int64)

In [ ]:
#select id,count(*) from t1 group by id

In [37]:
df['id'].value_counts()

111111     2
2222222    2
Name: id, dtype: int64

In [ ]:
#select * from df1 where id = 2222222

In [38]:
df.where(df['id'] == 2222222)

          id   nomes  valores
0        NaN     NaN      NaN
1        NaN     NaN      NaN
2  2222222.0   miura   4637.0
3  2222222.0  sandro    675.0

In [39]:
df.where(df['id'] == 2222222).dropna()

          id   nomes  valores
2  2222222.0   miura   4637.0
3  2222222.0  sandro    675.0

In [ ]:
#apply, aplica uma função a todos os valores de uma coluna

In [40]:
def dobro(n):
    return n*2

In [42]:
df

        id     nomes  valores
0   111111  anderson     1231
1   111111      ueda      545
2  2222222     miura     4637
3  2222222    sandro      675

In [44]:
df['nomes'].apply(len)

0    8
1    4
2    5
3    6
Name: nomes, dtype: int64

In [45]:
df['id'].apply(dobro)

0     222222
1     222222
2    4444444
3    4444444
Name: id, dtype: int64

In [46]:
df['valores'].apply(lambda x: x**2)

0     1515361
1      297025
2    21501769
3      455625
Name: valores, dtype: int64

In [47]:
df['id'] = df['id'].apply(lambda x: x * 2)

In [49]:
df['valores'] = df['valores'].apply(lambda x: x * 5 )

In [50]:
df

        id     nomes  valores
0   222222  anderson     6155
1   222222      ueda     2725
2  4444444     miura    23185
3  4444444    sandro     3375

In [55]:
#order by

In [59]:
df.sort_values('valores')

        id     nomes  valores
1   222222      ueda     2725
3  4444444    sandro     3375
0   222222  anderson     6155
2  4444444     miura    23185

In [60]:
del df['nomes']

In [61]:
df

        id  valores
0   222222     6155
1   222222     2725
2  4444444    23185
3  4444444     3375

In [65]:
a = 0

In [66]:
del a

In [67]:
a

NameError: name 'a' is not defined

In [68]:
df[['id','valores']]

        id  valores
0   222222     6155
1   222222     2725
2  4444444    23185
3  4444444     3375